Revit 2027 API
BuiltInFailures.RebarFailures.InvalidRebarHost Property
 Rebar can be placed only in Concrete Structural elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidRebarHost { get; }
Public Shared ReadOnly Property InvalidRebarHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidRebarHost {
	FailureDefinitionId^ get ();
}
static member InvalidRebarHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace